GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17115.inc
        LIST
;==========================================================================
;
;  Built by Great Cow BASIC convertor
;  MPASM processor include for the chip shown below
;
; C:\Users\admin\.mchp_packs\index.idx
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\xc8\pic\dat\ini\16F17115.ini
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\edc\PIC16F17115.PIC
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\xc8\pic\dat\cfgdata\16F17115.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __16F17115
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------

;-----Bank0------------------
INDF0            EQU  H'0000'
INDF1            EQU  H'0001'
PCL              EQU  H'0002'
STATUS           EQU  H'0003'
FSR0             EQU  H'0004'
FSR0L            EQU  H'0004'
FSR0H            EQU  H'0005'
FSR1             EQU  H'0006'
FSR1L            EQU  H'0006'
FSR1H            EQU  H'0007'
BSR              EQU  H'0008'
WREG             EQU  H'0009'
PCLATH           EQU  H'000A'
INTCON           EQU  H'000B'
PORTA            EQU  H'000C'
TRISA            EQU  H'0012'
LATA             EQU  H'0018'

;-----Bank1------------------
PIR0             EQU  H'008C'
PIR1             EQU  H'008D'
PIR2             EQU  H'008E'
PIR3             EQU  H'008F'
PIR4             EQU  H'0090'
PIR5             EQU  H'0091'
PIR6             EQU  H'0092'
PIE0             EQU  H'0096'
PIE1             EQU  H'0097'
PIE2             EQU  H'0098'
PIE3             EQU  H'0099'
PIE4             EQU  H'009A'
PIE5             EQU  H'009B'
PIE6             EQU  H'009C'

;-----Bank2------------------
PMD0             EQU  H'010C'
PMD1             EQU  H'010D'
PMD2             EQU  H'010E'
PMD3             EQU  H'010F'
PMD4             EQU  H'0110'

;-----Bank3------------------
WDTCON0          EQU  H'018C'
WDTCON1          EQU  H'018D'
WDTPS            EQU  H'018E'
WDTPSL           EQU  H'018E'
WDTPSH           EQU  H'018F'
WDTTMR           EQU  H'0190'
BORCON           EQU  H'0191'
PCON0            EQU  H'0192'
PCON1            EQU  H'0193'
TMR0L            EQU  H'019C'
TMR0             EQU  H'019C'
TMR0H            EQU  H'019D'
PR0              EQU  H'019D'
T0CON0           EQU  H'019E'
T0CON1           EQU  H'019F'

;-----Bank4------------------
FVRCON           EQU  H'020C'
CPCON            EQU  H'020D'
ZCDCON           EQU  H'021F'

;-----Bank5------------------
CPUDOZE          EQU  H'028C'
OSCCON1          EQU  H'028D'
OSCCON2          EQU  H'028E'
OSCCON3          EQU  H'028F'
OSCSTAT          EQU  H'0290'
OSCEN            EQU  H'0291'
OSCTUNE          EQU  H'0292'
OSCFRQ           EQU  H'0293'
ACTCON           EQU  H'0294'
CLKRCON          EQU  H'0296'
CLKRCLK          EQU  H'0297'

;-----Bank6------------------
TMR1             EQU  H'030C'
TMR1L            EQU  H'030C'
TMR1H            EQU  H'030D'
T1CON            EQU  H'030E'
T1GCON           EQU  H'030F'
PR1              EQU  H'030F'
T1GATE           EQU  H'0310'
TMR1GATE         EQU  H'0310'
T1CLK            EQU  H'0311'
TMR1CLK          EQU  H'0311'
TMR3             EQU  H'0312'
TMR3L            EQU  H'0312'
TMR3H            EQU  H'0313'
T3CON            EQU  H'0314'
T3GCON           EQU  H'0315'
PR3              EQU  H'0315'
T3GATE           EQU  H'0316'
TMR3GATE         EQU  H'0316'
T3CLK            EQU  H'0317'
TMR3CLK          EQU  H'0317'

;-----Bank7------------------
T2TMR            EQU  H'038C'
TMR2             EQU  H'038C'
T2PR             EQU  H'038D'
PR2              EQU  H'038D'
T2CON            EQU  H'038E'
T2HLT            EQU  H'038F'
T2CLKCON         EQU  H'0390'
T2CLK            EQU  H'0390'
T2RST            EQU  H'0391'
T4TMR            EQU  H'0392'
TMR4             EQU  H'0392'
T4PR             EQU  H'0393'
PR4              EQU  H'0393'
T4CON            EQU  H'0394'
T4HLT            EQU  H'0395'
T4CLKCON         EQU  H'0396'
T4CLK            EQU  H'0396'
T4RST            EQU  H'0397'

;-----Bank8------------------
CCPR1            EQU  H'040C'
CCPR1L           EQU  H'040C'
CCPR1H           EQU  H'040D'
CCP1CON          EQU  H'040E'
CCP1CAP          EQU  H'040F'
CCPR2            EQU  H'0410'
CCPR2L           EQU  H'0410'
CCPR2H           EQU  H'0411'
CCP2CON          EQU  H'0412'
CCP2CAP          EQU  H'0413'
CCPTMRS0         EQU  H'041F'

;-----Bank9------------------
PWM1ERS          EQU  H'048C'
PWM1CLK          EQU  H'048D'
PWM1LDS          EQU  H'048E'
PWM1PR           EQU  H'048F'
PWM1PRL          EQU  H'048F'
PWM1PRH          EQU  H'0490'
PWM1CPRE         EQU  H'0491'
PWM1PIPOS        EQU  H'0492'
PWM1GIR          EQU  H'0493'
PWM1GIE          EQU  H'0494'
PWM1CON          EQU  H'0495'
PWM1S1CFG        EQU  H'0496'
PWM1S1P1         EQU  H'0497'
PWM1S1P1L        EQU  H'0497'
PWM1S1P1H        EQU  H'0498'
PWM1S1P2         EQU  H'0499'
PWM1S1P2L        EQU  H'0499'
PWM1S1P2H        EQU  H'049A'
PWMLOAD          EQU  H'049E'
PWMEN            EQU  H'049F'

;-----Bank10------------------
PWM2ERS          EQU  H'050C'
PWM2CLK          EQU  H'050D'
PWM2LDS          EQU  H'050E'
PWM2PR           EQU  H'050F'
PWM2PRL          EQU  H'050F'
PWM2PRH          EQU  H'0510'
PWM2CPRE         EQU  H'0511'
PWM2PIPOS        EQU  H'0512'
PWM2GIR          EQU  H'0513'
PWM2GIE          EQU  H'0514'
PWM2CON          EQU  H'0515'
PWM2S1CFG        EQU  H'0516'
PWM2S1P1         EQU  H'0517'
PWM2S1P1L        EQU  H'0517'
PWM2S1P1H        EQU  H'0518'
PWM2S1P2         EQU  H'0519'
PWM2S1P2L        EQU  H'0519'
PWM2S1P2H        EQU  H'051A'

;-----Bank11------------------
NCO1ACC          EQU  H'058C'
NCO1ACCL         EQU  H'058C'
NCO1ACCH         EQU  H'058D'
NCO1ACCU         EQU  H'058E'
NCO1INC          EQU  H'058F'
NCO1INCL         EQU  H'058F'
NCO1INCH         EQU  H'0590'
NCO1INCU         EQU  H'0591'
NCO1CON          EQU  H'0592'
NCO1CLK          EQU  H'0593'

;-----Bank12------------------
CWG1CLK          EQU  H'060C'
CWG1CLKCON       EQU  H'060C'
CWG1ISM          EQU  H'060D'
CWG1DAT          EQU  H'060D'
CWG1DBR          EQU  H'060E'
CWG1DBF          EQU  H'060F'
CWG1CON0         EQU  H'0610'
CWG1CON1         EQU  H'0611'
CWG1AS0          EQU  H'0612'
CWG1AS1          EQU  H'0613'
CWG1STR          EQU  H'0614'

;-----Bank13------------------
CLCNCON          EQU  H'068C'
CLCNPOL          EQU  H'068D'
CLCNSEL0         EQU  H'068E'
CLCNSEL1         EQU  H'068F'
CLCNSEL2         EQU  H'0690'
CLCNSEL3         EQU  H'0691'
CLCNGLS0         EQU  H'0692'
CLCNGLS1         EQU  H'0693'
CLCNGLS2         EQU  H'0694'
CLCNGLS3         EQU  H'0695'
CLCSELECT        EQU  H'0696'
CLCDATA          EQU  H'0697'

